content/main/20211011143205-relational_database.md
+++
title = "Relational Database"
author = ["System Administrator"]
draft = false
+++

ca:PROPERTIES:
:ID:       916112C1-589D-4FC2-B430-93EB989A1350


## Relational Model {#relational-model}


### Relation {#relation}

table with columns and rows
records([Tuple](#tuple)s) with common attributes


### Attribute {#attribute}

named column

|             |            |
|-------------|------------|
| attribute 1 | attrbute 2 |


### Domain {#domain}

allowable values for [Attribute](#attribute)
e.g: Age ==&gt; Positive Integer


### Tuple {#tuple}

a row of a relation


### Degree {#degree}

the number of attributes of a [Relation](#relation)


### Cardinality {#cardinality}

number of [Tuple](#tuple)s in a [Relation](#relation)


### Relation schema {#relation-schema}

Definition of a relation
Contains:

-   attributes
    -   name
    -   domain


### Relational database schema {#relational-database-schema}

A set of relation schemas.


### Primary key {#primary-key}


### Candidate key {#candidate-key}


### Foreign Key {#foreign-key}